<?php
/*=============================================================================
    データベースの接続開始
=============================================================================*/
/*----------------------------------------------------------------------------
    環境設定
----------------------------------------------------------------------------*/
$db_type = "mysql";
$db_host = "localhost";
$db_name = "framerefugee";
$db_user = "root";
$db_pass = "root";
$dsn = "{$db_type}:host={$db_host};dbname={$db_name};charset=utf8";
/*----------------------------------------------------------------------------
    データベースへの接続確立
----------------------------------------------------------------------------*/
try {
	$pdo = new PDO($dsn, $db_user, $db_pass);
	//エラーモード設定
	$pdo->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);
	//プリペアドステートメント用意
	$pdo->setAttribute(PDO::ATTR_EMULATE_PREPARES, false);
	//デバッグ用
	print "接続完了";
} catch(PDOException $e){
	//エラー発生時処理停止してエラー表示
	die("エラー: " . $e->getMessage());
}
?>
/*=============================================================================
    データベースの接続終了
=============================================================================*/
<?php $page_title = "ブログ"; ?>
<?php require "header.php"; ?>
    <p>
      準備中
    </p>
<?php require "footer.php"; ?>
<?php
/*=============================================================================
    関数コーナー
=============================================================================*/
//サニタイズを多用するのでhtmlentities()を簡略化
function he($str){
  return htmlentities($str, ENT_QUOTES, "utf-8");
}
?>