<?php
/*-----------------------------------------------------------------------------
    環境設定とライブラリを読み込み
-----------------------------------------------------------------------------*/
require_once("common.php");
// セッションの開始
session_start();
/*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    ログイン状態のチェック開始、ログイン成功時$_SESSION["user_id"]にデーターベースのuser_idフィールドの値が挿入される
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*/
//ログインフラグ$logined_flagを初期化(非ログイン状態に)
$logined_flag = false;
/*=============================================================================
    ログインページ(login.php)以外の時
=============================================================================*/
if (!isset($ignore_login)) {
/*-----------------------------------------------------------------------------
    ログイン状態時の処理、$_SESSION["user_id"]の値がデータベース（user_idフィールド）にあればログインフラッグをtrueに
-----------------------------------------------------------------------------*/
    if (isset($_SESSION["user_id"])) {
        try {
            $sql = "SELECT * FROM users WHERE user_id = :session_user_id LIMIT 1";
            $stmt = $pdo->prepare($sql);
            $stmt->bindValue(":session_user_id", $_SESSION["user_id"], PDO::PARAM_INT);
            $stmt->execute();
            $row_user = $stmt->fetch(PDO::FETCH_ASSOC);
            if ($row_user) {
                // 該当のuserレコードがあったらログイン状態にする
                $logined_flag = true;
            }
        } catch (PDOException $e) {
            // エラー発生時
            die("エラー: " . $e->getMessage());
        }
    }
/*-----------------------------------------------------------------------------
    非ログイン状態時の処理
-----------------------------------------------------------------------------*/
    if (!$logined_flag) {
        //ログインページへジャンプ
        header("location: login.php");
        exit;
    }
}
/*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    ログイン状態のチェック終了
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*/
?>