<?php
/*=============================================================================
    <<ユーザー定義関数
=============================================================================*/
/*-----------------------------------------------------------------------------
    サニタイズを多用するのでhtmlentities()を簡略化
-----------------------------------------------------------------------------*/
function he($str) {
 	return htmlentities($str, ENT_QUOTES, "utf-8");
}
/*-----------------------------------------------------------------------------
    変数をホワイトリスト化
-----------------------------------------------------------------------------*/
//$_REQUEST[]の取りうるキーを限定する
function whitelist($whitelists) {
  $request = array();
  //入力欄が空欄なら連想配列$requestにnull、入力値があるならその値を格納
  foreach($whitelists as $whitelist){
      $request[$whitelist] = null;
      if(isset($_REQUEST[$whitelist])){
        //keyからヌルバイト除去
        $whitelist = str_replace("\0", "", $whitelist);
        $request[$whitelist] = $_REQUEST[$whitelist];
      }
  }
  return $request;
}
/*-----------------------------------------------------------------------------
    フレームidからフレーム情報を配列$form[]で返す
-----------------------------------------------------------------------------*/
/*
function frame_id($frame_id) {
    $stmt = null;
  //require_once("db_connect.php");
    $sql = "select * from frames where :frame_id = $frame_id";
    $stmt = $pdo->prepare($sql);
    $stmt->bindValue(":frame_id", $frame_id, PDO::PARAM_INT);
    $row_frame = $stmt->fetch(PDO::FETCH_ASSOC);
    $stmt = null;
    return $row_frame;
}
*/
/*=============================================================================
    ユーザー定義関数>>
=============================================================================*/
/*=============================================================================
    特定のURLを含むかどうかのフラグ変数まとめ開始
=============================================================================*/
$url = $_SERVER['REQUEST_URI'];
/*-----------------------------------------------------------------------------
    マイページのディレクトリの中かどうかのチェック
-----------------------------------------------------------------------------*/
$is_mypage = strpos($url,'/mypage/');
/*-----------------------------------------------------------------------------
    マイページのトップ画面かどうかのチェック
-----------------------------------------------------------------------------*/
$is_mypage_top = preg_match("/mypage\/$/", $url);
/*-----------------------------------------------------------------------------
    フレーム詳細ページかどうかのチェック
-----------------------------------------------------------------------------*/
$is_detail_page = preg_match("/detail\.php\?frame_id=/", $url);
/*=============================================================================
    特定のURLを含むかどうかのフラグ変数まとめ終了
=============================================================================*/

?>