<?php
// セッションの開始
session_start();
/*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    ログイン状態のチェック開始、ログイン成功時$_SESSION["user_id"]にデーターベースのuser_idフィールドの値が挿入される
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*/
//ログインフラグ$login_flagを初期化(非ログイン状態に)
$login_flag = false;
/*=============================================================================
    ログインページ(login.php)以外の時
=============================================================================*/
if (!isset($is_login_page)) {
/*-----------------------------------------------------------------------------
    ログイン状態時の処理、$_SESSION["user_id"]の値がデータベース（user_idフィールド）にあればログインフラッグをtrueに
-----------------------------------------------------------------------------*/
    if (isset($_SESSION["user_id"])) {
        try {
            $sql = "SELECT * FROM users WHERE user_id = :session_user_id LIMIT 1";
            $stmt = $pdo->prepare($sql);
            $stmt->bindValue(":session_user_id", $_SESSION["user_id"], PDO::PARAM_INT);
            $stmt->execute();
            $row_user = $stmt->fetch(PDO::FETCH_ASSOC);
            if ($row_user) {
                // 該当のuserレコードがあったらログイン状態にする
                $login_flag = true;
            }
        } catch (PDOException $e) {
            // エラー発生時
            die("エラー: " . $e->getMessage());
        }
    }
/*-----------------------------------------------------------------------------
    非ログイン状態かつ管理ページの時
-----------------------------------------------------------------------------*/
    $url = $_SERVER['REQUEST_URI'];
    if (!$login_flag && strpos($url,'/admin/') == true) {
        //ログインページへジャンプ
        header("location: login.php");
        exit;
    }
}
/*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    ログイン状態のチェック終了
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*/
?>